galal10/STM32F103C6-drivers/Stm32_F103C8_drivers/inc/Stm32_F103C8_gpio_driver.h
/*
 * Stm32_F103C8_gpio_driver.h
 *
 *  Created on: Jul 19, 2023
 *      Author: galal
 */

#ifndef INC_STM32_F103C8_GPIO_DRIVER_H_
#define INC_STM32_F103C8_GPIO_DRIVER_H_

#include "stm32f103x8.h"

//--------------------------------

//Config Structure

typedef struct
{
	uint16_t GPIO_PinNumber; // Specifies GPIO pins to be configured.
							 // This parameter must be set based on @ref GPIO_PINS_define

	uint8_t GPIO_mode;		 // Specifies the operating mode for the selected pins
							 // This parameter can be a value of @ref GPIO_MODE_define

	uint8_t	GPIO_OutputSpeed;// Specifies the speed for the selected pins
							 // This parameter can be a value of @ref GPIO_SPEED_define
}GPIO_PinConfig_t;


//================================
//Macros Configurations References
//================================

// @ref GPIO_PIN_state
#define GPIO_PIN_SET		1
#define GPIO_PIN_RESET		0


// @ref GPIO_RETURN_LOCK
#define GPIO_LOCK_EN			1
#define GPIO_LOCK_ERROR			0

// @ref GPIO_PINS_define
#define GPIO_PIN_0			((uint16_t)0x0001) /* Pin 0 selected  	*/
#define GPIO_PIN_1			((uint16_t)0x0002) /* Pin 1 selected  	*/
#define GPIO_PIN_2			((uint16_t)0x0004) /* Pin 2 selected  	*/
#define GPIO_PIN_3			((uint16_t)0x0008) /* Pin 3 selected  	*/
#define GPIO_PIN_4			((uint16_t)0x0010) /* Pin 4 selected  	*/
#define GPIO_PIN_5			((uint16_t)0x0020) /* Pin 5 selected  	*/
#define GPIO_PIN_6			((uint16_t)0x0040) /* Pin 6 selected  	*/
#define GPIO_PIN_7			((uint16_t)0x0080) /* Pin 7 selected  	*/
#define GPIO_PIN_8			((uint16_t)0x0100) /* Pin 8 selected  	*/
#define GPIO_PIN_9			((uint16_t)0x0200) /* Pin 9 selected  	*/
#define GPIO_PIN_10			((uint16_t)0x0400) /* Pin 10 selected 	*/
#define GPIO_PIN_11			((uint16_t)0x0800) /* Pin 11 selected 	*/
#define GPIO_PIN_12			((uint16_t)0x1000) /* Pin 12 selected 	*/
#define GPIO_PIN_13			((uint16_t)0x2000) /* Pin 13 selected 	*/
#define GPIO_PIN_14			((uint16_t)0x4000) /* Pin 14 selected 	*/
#define GPIO_PIN_15			((uint16_t)0x8000) /* Pin 15 selected 	*/
#define GPIO_PIN_ALL		((uint16_t)0xFFFF) /* All Pins selected */

#define GPIO_PIN_MASK		0x0000FFFFu


//@ref GPIO_MODE_define
//00: Analog mode
//1: Floating input (reset state)
//2: Input pull-up
//3: Input pull-down
//4: General purpose output push-pull
//5: General purpose output Open-drain
//6: Alternate function output Push-pull
//7: Alternate function output Open-drain
//8: Alternate function Input
#define GPIO_ANALOG_MODE			0x00000000u //Analog mode
#define GPIO_INPUT_FLO_MODE			0x00000001u //Floating input
#define GPIO_INPUT_PU_MODE			0x00000002u //Input pull-up
#define GPIO_INPUT_PD_MODE			0x00000003u //Input pull-down
#define GPIO_OUTPUT_PP_MODE			0x00000004u //General purpose output push-pull
#define GPIO_OUTPUT_OD_MODE			0x00000005u //General purpose output Open-drain
#define GPIO_OUTPUT_AF_PP_MODE		0x00000006u //Alternate function output Push-pull
#define GPIO_OUTPUT_AF_OD_MODE		0x00000007u //Alternate function output Open-drain
#define GPIO_INPUT_AF_MODE			0x00000008u //Alternate function Input


//@ref GPIO_SPEED_define
//1: Output mode, max speed 10 MHz.
//2: Output mode, max speed 2  MHz.
//3: Output mode, max speed 50 MHz

#define GPIO_SPEED_10M				0x00000001u //Output mode, max speed 10 MHz.
#define GPIO_SPEED_2M				0x00000002u //Output mode, max speed 2  MHz.
#define GPIO_SPEED_50M				0x00000003u //Output mode, max speed 50 MHz.


/*
 * =====================================================================================
 * 							APIS Supported by "MCAL GPIO driver"
 * =====================================================================================
 */

void MCAL_GPIO_init(GPIO_TypeDef* GPIOx, GPIO_PinConfig_t* PinConfig);
void MCAL_GPIO_DeInit(GPIO_TypeDef* GPIOx);

uint8_t MCAL_GPIO_ReadPin(GPIO_TypeDef* GPIOx, uint16_t PinNumber);
uint16_t MCAL_GPIO_ReadPort(GPIO_TypeDef* GPIOx);

void MCAL_GPIO_WritePin(GPIO_TypeDef* GPIOx, uint16_t PinNumber, uint8_t value);
void MCAL_GPIO_WritePort(GPIO_TypeDef* GPIOx, uint16_t value);

void MCAL_GPIO_TogglePin(GPIO_TypeDef* GPIOx, uint16_t PinNumber);
void MCAL_GPIO_TogglePort(GPIO_TypeDef* GPIOx);

uint8_t MCAL_GPIO_LockPin(GPIO_TypeDef* GPIOx, uint16_t PinNumber);


#endif /* INC_STM32_F103C8_GPIO_DRIVER_H_ */
